adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.h
typedef struct {                                /*!< (@ 0x40000000) DCNF_NS Structure                                          */
  __IM  uint32_t  RESERVED[264];
  __IM  uint32_t  CPUID;                        /*!< (@ 0x00000420) CPU number in the system                                   */
  __IM  uint32_t  RESERVED1[7];
  __IOM DCNF_EXTPERI0_Type EXTPERI0;            /*!< (@ 0x00000440) Unspecified                                                */
  __IM  uint32_t  RESERVED2[6];
  __IOM DCNF_EXTRAM_Type EXTRAM;                /*!< (@ 0x00000460) Unspecified                                                */
  __IM  uint32_t  RESERVED3[6];
  __IOM DCNF_EXTCODE_Type EXTCODE[2];           /*!< (@ 0x00000480) Unspecified                                                */
  __IOM uint32_t  CSTNUMPRETICKS;               /*!< (@ 0x00000488) ClockStatusTracker pretick count setting                   */
  __IOM uint32_t  CSTNUMPOSTTICKS;              /*!< (@ 0x0000048C) ClockStatusTracker posttick count setting                  */
} NRF_DCNF_Type;                                /*!< Size = 1168 (0x490)                                                       */



/* =========================================================================================================================== */
/* ================                                     TRACEANDDEBUG_NS                                      ================ */
/* =========================================================================================================================== */


/**
  * @brief Trace And Debug (TRACEANDDEBUG_NS)
  */

typedef struct {                                /*!< (@ 0xE0080000) TRACEANDDEBUG_NS Structure                                 */
  __OM  uint32_t  STARTCLOCKS;                  /*!< (@ 0x00000000) Start all Trace and Debug clocks.                          */
  __OM  uint32_t  STOPCLOCKS;                   /*!< (@ 0x00000004) Stop all Trace and Debug clocks.                           */
  __IM  uint32_t  RESERVED[318];
  __IOM uint32_t  ENABLEDEBUG;                  /*!< (@ 0x00000500) Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk
                                                                    signals                                                    */
  __IOM TRACEANDDEBUG_PSEL_Type PSEL;           /*!< (@ 0x00000504) Unspecified                                                */
  __IOM uint32_t  TRACEPORTSPEED;               /*!< (@ 0x00000518) Trace port speed selection                                 */
  __IOM uint32_t  SWOSEL;                       /*!< (@ 0x0000051C) Connect the SWO to the TPIU TRACEDATA[0]                   */
} NRF_TRACEANDDEBUG_Type;                       /*!< Size = 1312 (0x520)                                                       */



/* =========================================================================================================================== */
/* ================                                          MWU_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Memory Watch Unit (MWU_NS)
  */

typedef struct {                                /*!< (@ 0x40001000) MWU_NS Structure                                           */
  __IM  uint32_t  RESERVED[64];
  __IOM MWU_EVENTS_REGION_Type EVENTS_REGION[4];/*!< (@ 0x00000100) Peripheral events.                                         */
  __IM  uint32_t  RESERVED1[120];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED2[5];
  __IOM uint32_t  NMIEN;                        /*!< (@ 0x00000320) Enable or disable interrupt                                */
  __IOM uint32_t  NMIENSET;                     /*!< (@ 0x00000324) Enable interrupt                                           */
  __IOM uint32_t  NMIENCLR;                     /*!< (@ 0x00000328) Disable interrupt                                          */
  __IM  uint32_t  RESERVED3[121];
  __IOM uint32_t  REGIONEN;                     /*!< (@ 0x00000510) Enable/disable regions watch                               */
  __IOM uint32_t  REGIONENSET;                  /*!< (@ 0x00000514) Enable regions watch                                       */
  __IOM uint32_t  REGIONENCLR;                  /*!< (@ 0x00000518) Disable regions watch                                      */
  __IM  uint32_t  RESERVED4[57];
  __IOM MWU_REGION_Type REGION[4];              /*!< (@ 0x00000600) Unspecified                                                */
} NRF_MWU_Type;                                 /*!< Size = 1600 (0x640)                                                       */



/* =========================================================================================================================== */
/* ================                                         MCPLL_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Modem Clock PLL (MCPLL_NS)
  */

typedef struct {                                /*!< (@ 0x40010000) MCPLL_NS Structure                                         */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start MCPLL                                                */
  __OM  uint32_t  TASKS_UPDATE;                 /*!< (@ 0x00000004) Update CONTROL.FRAC and CONTROL.INT values                 */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000008) Stop MCPLL                                                 */
  __IM  uint32_t  RESERVED[61];
  __IOM uint32_t  EVENTS_LOCKERROR;             /*!< (@ 0x00000100) Error event, MCPLL no longer in lock                       */
  __IM  uint32_t  RESERVED1[127];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[60];
  __IM  uint32_t  INLOCK;                       /*!< (@ 0x00000400) MCPLL locked or not                                        */
  __IM  uint32_t  RESERVED3[64];
  __IOM MCPLL_CONTROL_Type CONTROL;             /*!< (@ 0x00000504) Unspecified                                                */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  MA;                           /*!< (@ 0x00000510) Post division ratio for OUTA                               */
  __IOM uint32_t  MB;                           /*!< (@ 0x00000514) Post division ratio for OUTB                               */
  __IOM uint32_t  MC;                           /*!< (@ 0x00000518) Post division ratio for OUTC                               */
  __IOM uint32_t  MD;                           /*!< (@ 0x0000051C) Post division ratio for OUTD                               */
  __IOM uint32_t  FORCEINLOCK;                  /*!< (@ 0x00000520) Force MCPLL in lock                                        */
  __IOM uint32_t  RESET;                        /*!< (@ 0x00000524) Reset MCPLL                                                */
  __IOM uint32_t  SPARE;                        /*!< (@ 0x00000528) Spare signals                                              */
  __IM  uint32_t  RESERVED5;
  __IOM MCPLL_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000530) Override mechanism                                         */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  OUTA_DRV;                     /*!< (@ 0x00000540) Drive strength for OUTA                                    */
  __IOM uint32_t  OUTB_DRV;                     /*!< (@ 0x00000544) Drive strength for OUTB                                    */
  __IOM uint32_t  OUTC_DRV;                     /*!< (@ 0x00000548) Drive strength for OUTC                                    */
  __IOM uint32_t  OUTD_DRV;                     /*!< (@ 0x0000054C) Drive strength for OUTD                                    */
  __IOM uint32_t  INTMODE;                      /*!< (@ 0x00000550) Integer mode                                               */
  __IM  uint32_t  RESERVED7[43];
  __IOM uint32_t  TEST;                         /*!< (@ 0x00000600) ATE test bus control                                       */
  __IOM uint32_t  ATB_ENABLE;                   /*!< (@ 0x00000604) Analog switch control for connecting ATB to GPIOs.
                                                                    Note that when the analog switch is enabled,
                                                                    digital driver of the GPIO must be in hiZ.
                                                                    Note also that the analog switch can be
                                                                    enabled also from elsewhere for testing
                                                                    other analog IPs.                                          */
} NRF_MCPLL_Type;                               /*!< Size = 1544 (0x608)                                                       */



/* =========================================================================================================================== */
/* ================                                         BBPLL_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Base Band  PLL (BBPLL_NS)
  */

typedef struct {                                /*!< (@ 0x40011000) BBPLL_NS Structure                                         */
  __IM  uint32_t  RESERVED[320];
  __IOM uint32_t  FREQ;                         /*!< (@ 0x00000500) Frequency selection                                        */
} NRF_BBPLL_Type;                               /*!< Size = 1284 (0x504)                                                       */



/* =========================================================================================================================== */
/* ================                                        RCOSC32K_NS                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief 32.768 kHz RC oscillator (RCOSC32K_NS)
  */

typedef struct {                                /*!< (@ 0x40012000) RCOSC32K_NS Structure                                      */
  __OM  uint32_t  TASKS_CAL;                    /*!< (@ 0x00000000) Start calibration of LFRC or LFULP oscillator              */
  __OM  uint32_t  TASKS_CTSTART;                /*!< (@ 0x00000004) Start calibration timer                                    */
  __OM  uint32_t  TASKS_CTSTOP;                 /*!< (@ 0x00000008) Stop calibration timer                                     */
  __IM  uint32_t  RESERVED[61];
  __IOM uint32_t  EVENTS_CTTO;                  /*!< (@ 0x00000100) Calibration timer timeout                                  */
  __IOM uint32_t  EVENTS_DONE;                  /*!< (@ 0x00000104) Calibration of LFCLK RC oscillator complete event          */
  __IOM uint32_t  EVENTS_CTSTARTED;             /*!< (@ 0x00000108) Calibration timer started                                  */
  __IOM uint32_t  EVENTS_CTSTOPPED;             /*!< (@ 0x0000010C) Calibration timer stopped                                  */
  __IM  uint32_t  RESERVED1[124];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED2[69];
  __IM  uint32_t  RCOSC32KIFINE;                /*!< (@ 0x00000420) Fine calibration read value for 32.768 kHz RC
                                                                    oscillator                                                 */
  __IM  uint32_t  RCOSC32KICOARSE;              /*!< (@ 0x00000424) Coarse calibration read value for 32.768 kHz
                                                                    RC oscillator                                              */
  __IM  uint32_t  RESERVED3[67];
  __IOM uint32_t  RCOSC32KICALTEST;             /*!< (@ 0x00000534) 32.768 kHz RC oscillator calibration debug register
                                                                    NOTE: This register should not be written
                                                                    to while the RCOSC source is running.                      */
  __IOM uint32_t  CTIV;                         /*!< (@ 0x00000538) Calibration timer interval NOTE: This register
                                                                    should not be written to while the RCOSC
                                                                    source is running.                                         */
  __IOM uint32_t  RCOSC32KICALLENGTH;           /*!< (@ 0x0000053C) 32kHz RC oscillator calibration length This value
                                                                    is read from FICR                                          */
  __IOM uint32_t  RCOSC32KICOARSEIN;            /*!< (@ 0x00000540) RCOSC coarse calibration input This value is
                                                                    read from FICR                                             */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  RCOSC32KICIRC;                /*!< (@ 0x0000054C) Rotating current source for for 32.768 kHz RC
                                                                    oscillator                                                 */
  __IM  uint32_t  RESERVED5[13];
  __IOM uint32_t  ATECLOCK;                     /*!< (@ 0x00000584) Analog test bus control for clock modules                  */
  __IM  uint32_t  RESERVED6[11];
  __IOM uint32_t  LFRCMODE;                     /*!< (@ 0x000005B4) LFRC mode configuration                                    */
  __IOM uint32_t  LFULP32KICOARSEIN;            /*!< (@ 0x000005B8) LFULP coarse calibration input This value is
                                                                    read from FICR                                             */
  __IOM uint32_t  LFULP32KICALLENGTH;           /*!< (@ 0x000005BC) 32kHz LFULP RC oscillator calibration length
                                                                    This value is read from FICR                               */
  __IM  uint32_t  RESERVED7[399];
  __IOM uint32_t  DISBALERCOSC32KIPOWERUPCONTROL;/*!< (@ 0x00000BFC) Backdoor for disabling Rcosc32KiPowerUpControl
                                                                    module in Rcosc32KiGenerator.                              */
} NRF_RCOSC32K_Type;                            /*!< Size = 3072 (0xc00)                                                       */



/* =========================================================================================================================== */
/* ================                                         CLOCK_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock Management (CLOCK_NS)
  */

typedef struct {                                /*!< (@ 0x40015000) CLOCK_NS Structure                                         */
  __OM  uint32_t  TASKS_HFCLKSTART;             /*!< (@ 0x00000000) Start HFCLK crystal oscillator                             */
  __OM  uint32_t  TASKS_HFCLKSTOP;              /*!< (@ 0x00000004) Stop HFCLK crystal oscillator                              */
  __OM  uint32_t  TASKS_LFCLKSTART;             /*!< (@ 0x00000008) Start LFCLK source                                         */
  __OM  uint32_t  TASKS_LFCLKSTOP;              /*!< (@ 0x0000000C) Stop LFCLK source                                          */
  __OM  uint32_t  TASKS_CAL;                    /*!< (@ 0x00000010) Start RCOSC32k calibration                                 */
  __IM  uint32_t  RESERVED[59];
  __IOM uint32_t  EVENTS_HFCLKSTARTED;          /*!< (@ 0x00000100) HFCLK oscillator started                                   */
  __IOM uint32_t  EVENTS_LFCLKSTARTED;          /*!< (@ 0x00000104) LFCLK started                                              */
  __IM  uint32_t  RESERVED1[126];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[62];
  __IM  uint32_t  HFCLKRUN;                     /*!< (@ 0x00000408) Status indicating that HFCLKSTART task has been
                                                                    triggered                                                  */
  __IM  uint32_t  HFCLKSTAT;                    /*!< (@ 0x0000040C) Which HFCLK source is running                              */
  __IM  uint32_t  RESERVED3;
  __IM  uint32_t  LFCLKRUN;                     /*!< (@ 0x00000414) Status indicating that LFCLKSTART task has been
                                                                    triggered                                                  */
  __IM  uint32_t  LFCLKSTAT;                    /*!< (@ 0x00000418) Which LFCLK source is running                              */
  __IM  uint32_t  LFCLKSRCCOPY;                 /*!< (@ 0x0000041C) Copy of LFCLKSRC register, set when LFCLKSTART
                                                                    task was triggered LFULP is not treat as
                                                                    a separate clock source on Alta MLM1, where
                                                                    default clock source (0) is LFRC.                          */
  __IM  uint32_t  RESERVED4[61];
  __IOM uint32_t  HFCLKSRC;                     /*!< (@ 0x00000514) Clock source for the HFCLK oscillator, and configuration
                                                                    of XTAL oscillator. This register shall
                                                                    only be written while no oscillation is
                                                                    present on XC1. Failing to do so may cause
                                                                    unexpected behaviour.                                      */
  __IOM uint32_t  LFCLKSRC;                     /*!< (@ 0x00000518) Clock source for the LFCLK. LFCLKSTART task starts
                                                                    starts a clock source selected with this
                                                                    register. LFULP is not treat as a separate
                                                                    clock source on Alta MLM1, where default
                                                                    clock source (0) is LFRC.                                  */
} NRF_CLOCK_Type;                               /*!< Size = 1308 (0x51c)                                                       */



/* =========================================================================================================================== */
/* ================                                         POWER_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Power Control (POWER_NS)
  */

