adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.h
typedef struct {                                /*!< (@ 0x40027000) LWDT_NS Structure                                          */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start the watchdog                                         */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop the watchdog timer. Only available in timer
                                                                    mode.                                                      */
  __IM  uint32_t  RESERVED[62];
  __IOM uint32_t  EVENTS_TIMEOUT;               /*!< (@ 0x00000100) Watchdog timeout                                           */
  __IM  uint32_t  RESERVED1[128];
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED2[61];
  __IM  uint32_t  RUNSTATUS;                    /*!< (@ 0x00000400) Run status                                                 */
  __IM  uint32_t  REQSTATUS;                    /*!< (@ 0x00000404) Request status                                             */
  __IOM uint32_t  RCNT;                         /*!< (@ 0x00000408) Reload count                                               */
  __IM  uint32_t  RESERVED3[62];
  __IOM uint32_t  CRV;                          /*!< (@ 0x00000504) Counter reload value                                       */
  __IOM uint32_t  RREN;                         /*!< (@ 0x00000508) Enable register for reload request registers               */
  __IOM uint32_t  CONFIG;                       /*!< (@ 0x0000050C) Configuration register                                     */
  __IM  uint32_t  RESERVED4[60];
  __OM  uint32_t  RR[8];                        /*!< (@ 0x00000600) Description collection: Reload request n                   */
  __IM  uint32_t  RESERVED5[631];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_WDT_Type;                                 /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                          RNG_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Random Number Generator (RNG_NS)
  */

typedef struct {                                /*!< (@ 0x40029000) RNG_NS Structure                                           */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Task starting the random number generator                  */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Task stopping the random number generator                  */
  __IM  uint32_t  RESERVED[62];
  __IOM uint32_t  EVENTS_VALRDY;                /*!< (@ 0x00000100) Event being generated for every new random number
                                                                    written to the VALUE register                              */
  __IM  uint32_t  RESERVED1[63];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED3[126];
  __IOM uint32_t  CONFIG;                       /*!< (@ 0x00000504) Configuration register                                     */
  __IM  uint32_t  VALUE;                        /*!< (@ 0x00000508) Output random number                                       */
  __IM  uint32_t  RESERVED4[700];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_RNG_Type;                                 /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                         SIMIF_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SIM card interface (SIMIF_NS)
  */

typedef struct {                                /*!< (@ 0x4002A000) SIMIF_NS Structure                                         */
  __OM  uint32_t  TASKS_DMASTARTRX;             /*!< (@ 0x00000000) start DMA transfer from SIM card to memory                 */
  __OM  uint32_t  TASKS_DMASTOPRX;              /*!< (@ 0x00000004) stop DMA transfer from SIM card to memory                  */
  __OM  uint32_t  TASKS_DMASTARTTX;             /*!< (@ 0x00000008) start DMA transfer from memory to SIM card                 */
  __OM  uint32_t  TASKS_DMASTOPTX;              /*!< (@ 0x0000000C) start DMA transfer from memory to SIM card                 */
  __OM  uint32_t  TASKS_RSTSET;                 /*!< (@ 0x00000010) Set SIM card reset signal                                  */
  __OM  uint32_t  TASKS_RSTCLEAR;               /*!< (@ 0x00000014) Clear SIM card reset signal                                */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x00000018) Reset everything                                           */
  __OM  uint32_t  TASKS_UARTRX;                 /*!< (@ 0x0000001C) Start Uart for Rx access                                   */
  __OM  uint32_t  TASKS_UARTTX;                 /*!< (@ 0x00000020) Start Uart for Tx access                                   */
  __OM  uint32_t  TASKS_STARTWRITEFROMREG;      /*!< (@ 0x00000024) Write test data from Ahb test reg to Ahb Rx bus            */
  __OM  uint32_t  TASKS_STARTREADTOREG;         /*!< (@ 0x00000028) Read data from Ahb Tx bus to Ahb test reg                  */
  __OM  uint32_t  TASKS_PROTOCOLT0SET;          /*!< (@ 0x0000002C) Start using protocol T0                                    */
  __OM  uint32_t  TASKS_PROTOCOLT1SET;          /*!< (@ 0x00000030) Start using protocol T1                                    */
  __OM  uint32_t  TASKS_PROTOCOLNONSET;         /*!< (@ 0x00000034) Start using protocol none                                  */
  __OM  uint32_t  TASKS_TIMECOUNTCLEAR;         /*!< (@ 0x00000038) Stop and clear time out counter                            */
  __IM  uint32_t  RESERVED[49];
  __IOM uint32_t  EVENTS_DMA_RX_STARTED;        /*!< (@ 0x00000100) DMA Rx operation started                                   */
  __IOM uint32_t  EVENTS_DMA_RX_DONE;           /*!< (@ 0x00000104) DMA Tx operation finished                                  */
  __IOM uint32_t  EVENTS_DMA_TX_STARTED;        /*!< (@ 0x00000108) DMA Tx operation started                                   */
  __IOM uint32_t  EVENTS_DMA_TX_DONE;           /*!< (@ 0x0000010C) DMA Tx operation finished                                  */
  __IOM uint32_t  EVENTS_INVALID_CONVENTION;    /*!< (@ 0x00000110) ATR.TS convention not recognized                           */
  __IOM uint32_t  EVENTS_PARITY_ERROR;          /*!< (@ 0x00000114) Rx byte parity error                                       */
  __IOM uint32_t  EVENTS_ATR_TIMEOUT;           /*!< (@ 0x00000118) No ATR between 400 and 40000 sim clock cycles              */
  __IOM uint32_t  EVENTS_CW_TIMEOUT;            /*!< (@ 0x0000011C) T=1 character wait timeout                                 */
  __IOM uint32_t  EVENTS_BW_TIMEOUT;            /*!< (@ 0x00000120) Block Wait timeout                                         */
  __IOM uint32_t  EVENTS_SW1SW2;                /*!< (@ 0x00000124) SW1 and SW2 bytes received                                 */
  __IOM uint32_t  EVENTS_RESET;                 /*!< (@ 0x00000128) Everything reset                                           */
  __IOM uint32_t  EVENTS_INS;                   /*!< (@ 0x0000012C) T=0 procedure byte INS received                            */
  __IOM uint32_t  EVENTS_NINS;                  /*!< (@ 0x00000130) T=0 procedure byte !INS received                           */
  __IOM uint32_t  EVENTS_ERROR;                 /*!< (@ 0x00000134) Error response                                             */
  __IOM uint32_t  EVENTS_READY_TX;              /*!< (@ 0x00000138) Byte sent after START_WRITE_FROM_REG                       */
  __IOM uint32_t  EVENTS_RX_DATA_READY;         /*!< (@ 0x0000013C) Byte received after START_READ_TO_REG                      */
  __IOM uint32_t  EVENTS_T1_RX_OVERRUN;         /*!< (@ 0x00000140) Unexpected bytes received after DMA RX[0...N],
                                                                    SW1SW2 in T=1                                              */
  __IOM uint32_t  EVENTS_T1_TX_ABORTED;         /*!< (@ 0x00000144) T=1 card responded with S(ABORT request)                   */
  __IOM uint32_t  EVENTS_T1_NON_I_BLOCK;        /*!< (@ 0x00000148) T=1 unrecognized (S or R) block (with correct
                                                                    LRC) stored in RX_DATA                                     */
  __IOM uint32_t  EVENTS_T1_LEN_ERROR;          /*!< (@ 0x0000014C) T=1 LEN = 255                                              */
  __IOM uint32_t  EVENTS_EDC_ERROR;             /*!< (@ 0x00000150) T=1 EDC error                                              */
  __IOM uint32_t  EVENTS_NAD_ERROR;             /*!< (@ 0x00000154) T=1 NAD error                                              */
  __IOM uint32_t  EVENTS_EVENTS_ERROR_COUNT_MAX;/*!< (@ 0x00000158) number of unsuccessful rx or tx operations equals
                                                                    max value                                                  */
  __IOM uint32_t  EVENTS_EVENTS_T1_RX_MORE;     /*!< (@ 0x0000015C) More bit high in PCB of Rx T=1 I block                     */
  __IOM uint32_t  EVENTS_EVENTS_T1_RX_FRAME_END;/*!< (@ 0x00000160) Len byte + 1 bytes of T1 Rx data received                  */
  __IM  uint32_t  RESERVED1[39];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[66];
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[60];
  __IOM uint32_t  SW1SW2;                       /*!< (@ 0x00000400) Sw1 and Sw2 bytes received from Sim card in T=1
                                                                    mode                                                       */
  __IOM uint32_t  CONVENTION;                   /*!< (@ 0x00000404) Data convention used in traffic between controller
                                                                    and SIM card                                               */
  __IOM uint32_t  LRCOUT;                       /*!< (@ 0x00000408) Latest generated LRC value                                 */
  __IM  uint32_t  RXDATA;                       /*!< (@ 0x0000040C) NonDMA received data                                       */
  __IOM uint32_t  T0SWXCOUNT;                   /*!< (@ 0x00000410) Number of SWx bytes received after T=0 Rx DMA
                                                                    finished                                                   */
  __IM  uint32_t  RESERVED4[59];
  __IOM uint32_t  CLKRATE;                      /*!< (@ 0x00000500) Divider value for setting the clock rate to the
                                                                    SIM card.                                                  */
  __IOM uint32_t  BAUDRATE;                     /*!< (@ 0x00000504) Divider value for setting the baud rate to the
                                                                    SIM card.                                                  */
  __IOM uint32_t  CHARACTERGUARDTIME;           /*!< (@ 0x00000508) Character Guard time                                       */
  __IOM uint32_t  CHARACTERWAITTIME;            /*!< (@ 0x0000050C) Character Wait time                                        */
  __IOM uint32_t  BLOCKWAITTIME;                /*!< (@ 0x00000510) Block Wait time                                            */
  __IOM uint32_t  PROTOCOL;                     /*!< (@ 0x00000514) Protocol selection                                         */
  __IOM uint32_t  LOWIMPEDANCE;                 /*!< (@ 0x00000518) Low impedance driver use                                   */
  __IOM uint32_t  T1PCBCONTROL;                 /*!< (@ 0x0000051C) T=1 Tx PCB bits 5:6                                        */
  __IOM uint32_t  CLOCKCONTROL;                 /*!< (@ 0x00000520) Clock Control                                              */
  __IOM uint32_t  VOLTAGE;                      /*!< (@ 0x00000524) Sim card operating voltage                                 */
  __IOM uint32_t  LRCENABLE;                    /*!< (@ 0x00000528) LRC Calculation enable                                     */
  __OM  uint32_t  TXDATA;                       /*!< (@ 0x0000052C) NonDMA data to be sent to the SIM card                     */
  __IOM uint32_t  UARTCONFIG;                   /*!< (@ 0x00000530) Uart configuration                                         */
  __IOM uint32_t  WRITEMAXATT;                  /*!< (@ 0x00000534) Number of write attempts before error interrupt            */
  __IOM uint32_t  READMAXATT;                   /*!< (@ 0x00000538) Number of read attempts before error interrupt             */
  __IOM uint32_t  AHBTESTWRITE;                 /*!< (@ 0x0000053C) Test data to write through AHB RX bus                      */
  __IM  uint32_t  AHBTESTREAD;                  /*!< (@ 0x00000540) Test data to read through AHB TX bus                       */
  __IOM uint32_t  RXPROLOGUEDATA;               /*!< (@ 0x00000544) Four first Rx data bytes from card                         */
  __IM  uint32_t  RESERVED5[11];
  __IOM uint32_t  UARTENABLE;                   /*!< (@ 0x00000574) UART Enable                                                */
  __OM  uint32_t  UARTRXENABLE;                 /*!< (@ 0x00000578) UART Rx Enable                                             */
  __OM  uint32_t  UARTTXENABLE;                 /*!< (@ 0x0000057C) UART Tx Enable                                             */
  __IM  uint32_t  RESERVED6[32];
  __IOM uint32_t  DMARXADDR;                    /*!< (@ 0x00000600) DMA access buffer RAM start address                        */
  __IOM uint32_t  DMARXBUFFERSIZE;              /*!< (@ 0x00000604) Byte count to receive in Dma Rx operation                  */
  __IM  uint32_t  DMARXBYTECOUNT;               /*!< (@ 0x00000608) Byte count received in latest Dma Rx operation             */
  __IOM uint32_t  DMARXENABLE;                  /*!< (@ 0x0000060C) Enable for rx dma                                          */
  __IM  uint32_t  DMARXSELECTLIST;              /*!< (@ 0x00000610) Rx select address from list                                */
  __IM  uint32_t  RESERVED7[59];
  __IOM uint32_t  DMATXADDR;                    /*!< (@ 0x00000700) Start address for DMA access in buffer RAM                 */
  __IOM uint32_t  DMATXBUFFERSIZE;              /*!< (@ 0x00000704) Byte count to transmit in Dma Rx operation                 */
  __IM  uint32_t  DMATXBYTECOUNT;               /*!< (@ 0x00000708) Byte count transmitted in latest Dma Tx operation          */
  __IOM uint32_t  DMATXENABLE;                  /*!< (@ 0x0000070C) Enable for rx dma                                          */
  __IM  uint32_t  DMATXSELECTLIST;              /*!< (@ 0x00000710) Tx select address from list                                */
} NRF_SIMIF_Type;                               /*!< Size = 1812 (0x714)                                                       */



/* =========================================================================================================================== */
/* ================                                       RAMBISTHUB_NS                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief RAM BIST Hub (RAMBISTHUB_NS)
  */

typedef struct {                                /*!< (@ 0x4002B000) RAMBISTHUB_NS Structure                                    */
  __IOM uint32_t  RUN;                          /*!< (@ 0x00000000) RUN BIST                                                   */
  __IM  uint32_t  RESERVED[63];
  __IOM uint32_t  SLEEP;                        /*!< (@ 0x00000100) BIST SLEEP EVENT                                           */
  __IOM uint32_t  FINISHED;                     /*!< (@ 0x00000104) BIST FINISHED EVENT                                        */
  __IM  uint32_t  RESERVED1[254];
  __IOM uint32_t  HUBENABLE;                    /*!< (@ 0x00000500) RAM BIST Hub enable                                        */
  __IOM uint32_t  SELECTBIST;                   /*!< (@ 0x00000504) Select bits for the individual BISTs to run                */
  __IOM uint32_t  BISTSTATUS;                   /*!< (@ 0x00000508) BIST status                                                */
  __IOM uint32_t  TESTTYPE;                     /*!< (@ 0x0000050C) RAM BIST test type                                         */
  __OM  uint32_t  FORCEONRETENTION;             /*!< (@ 0x00000510) Power request override to force RAM retention
                                                                    on                                                         */
} NRF_RAMBISTHUB_Type;                          /*!< Size = 1300 (0x514)                                                       */



/* =========================================================================================================================== */
/* ================                                          M2M0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Memory to Memory DMA 0 (M2M0_NS)
  */

typedef struct {                                /*!< (@ 0x4002E000) M2M0_NS Structure                                          */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start DMA transfer                                         */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop DMA transfer                                          */
  __IM  uint32_t  RESERVED[62];
  __IOM uint32_t  EVENTS_END;                   /*!< (@ 0x00000100) DMA transfer complete                                      */
  __IOM uint32_t  EVENTS_STARTED;               /*!< (@ 0x00000104) DMA transfer started                                       */
  __IM  uint32_t  RESERVED1[126];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[128];
  __IOM M2M_IN_Type IN;                         /*!< (@ 0x00000510) Memory to memory input channel                             */
  __IOM M2M_OUT_Type OUT;                       /*!< (@ 0x00000520) Memory to memory output channel                            */
} NRF_M2M_Type;                                 /*!< Size = 1324 (0x52c)                                                       */



/* =========================================================================================================================== */
/* ================                                        GPIOTE0_NS                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Tasks and Events 0 (GPIOTE0_NS)
  */

