adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.h
typedef struct {                                /*!< (@ 0x4003B000) LFCLKCALIBMEAS_NS Structure                                */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start Measuring                                            */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Switch LfClkCalibMeas to STOPPED state. Brings
                                                                    LfClkCalibMeas from SHUTDOWN state to a
                                                                    configurable state before a measurement
                                                                    is launched.                                               */
  __OM  uint32_t  TASKS_SHUTDOWN;               /*!< (@ 0x00000008) Shut down LfClkCalibMeas                                   */
  __IM  uint32_t  RESERVED[61];
  __IOM uint32_t  EVENTS_COMPLETE;              /*!< (@ 0x00000100) Measurement completed.                                     */
  __IM  uint32_t  RESERVED1[127];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[60];
  __IM  uint32_t  RUNTIME;                      /*!< (@ 0x00000400) Runtime status of the measurement.                         */
  __IM  uint32_t  LCMEAS0;                      /*!< (@ 0x00000404) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS1;                      /*!< (@ 0x00000408) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS2;                      /*!< (@ 0x0000040C) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS3;                      /*!< (@ 0x00000410) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS4;                      /*!< (@ 0x00000414) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS5;                      /*!< (@ 0x00000418) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS6;                      /*!< (@ 0x0000041C) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS7;                      /*!< (@ 0x00000420) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS8;                      /*!< (@ 0x00000424) Results of the measurement.                                */
  __IM  uint32_t  LCMEAS9;                      /*!< (@ 0x00000428) Results of the measurement.                                */
  __IM  uint32_t  STATE;                        /*!< (@ 0x0000042C) Current running state of the IP.                           */
  __IM  uint32_t  RESERVED3[52];
  __IOM uint32_t  MEASLEN;                      /*!< (@ 0x00000500) Length of the measurement.                                 */
} NRF_LFCLKCALIBMEAS_Type;                      /*!< Size = 1284 (0x504)                                                       */



/* =========================================================================================================================== */
/* ================                                          TWIM_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C compatible Two-Wire Master Interface with EasyDMA (TWIM_NS)
  */

typedef struct {                                /*!< (@ 0x4003C000) TWIM_NS Structure                                          */
  __OM  uint32_t  TASKS_STARTRX;                /*!< (@ 0x00000000) Start TWI receive sequence                                 */
  __IM  uint32_t  RESERVED;
  __OM  uint32_t  TASKS_STARTTX;                /*!< (@ 0x00000008) Start TWI transmit sequence                                */
  __IM  uint32_t  RESERVED1[2];
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000014) Stop TWI transaction. Must be issued while the
                                                                    TWI master is not suspended.                               */
  __IM  uint32_t  RESERVED2;
  __OM  uint32_t  TASKS_SUSPEND;                /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
  __OM  uint32_t  TASKS_RESUME;                 /*!< (@ 0x00000020) Resume TWI transaction                                     */
  __IM  uint32_t  RESERVED3[56];
  __IOM uint32_t  EVENTS_STOPPED;               /*!< (@ 0x00000104) TWI stopped                                                */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  EVENTS_ENDRX;                 /*!< (@ 0x00000110) End of RXD buffer access by EasyDMA                        */
  __IM  uint32_t  RESERVED5[3];
  __IOM uint32_t  EVENTS_ENDTX;                 /*!< (@ 0x00000120) END of TXD buffer access by EasyDMA                        */
  __IOM uint32_t  EVENTS_ERROR;                 /*!< (@ 0x00000124) TWI error                                                  */
  __IM  uint32_t  RESERVED6[4];
  __IOM uint32_t  EVENTS_BB;                    /*!< (@ 0x00000138) TWI byte boundary, generated before each byte
                                                                    that is sent or received                                   */
  __IM  uint32_t  RESERVED7[3];
  __IOM uint32_t  EVENTS_SUSPENDED;             /*!< (@ 0x00000148) Last byte has been sent out after the SUSPEND
                                                                    task has been issued, TWI traffic is now
                                                                    suspended.                                                 */
  __IOM uint32_t  EVENTS_RXSTARTED;             /*!< (@ 0x0000014C) Receive sequence started                                   */
  __IOM uint32_t  EVENTS_TXSTARTED;             /*!< (@ 0x00000150) Transmit sequence started                                  */
  __IM  uint32_t  RESERVED8[2];
  __IOM uint32_t  EVENTS_LASTRX;                /*!< (@ 0x0000015C) Byte boundary, starting to receive the last byte           */
  __IOM uint32_t  EVENTS_LASTTX;                /*!< (@ 0x00000160) Byte boundary, starting to transmit the last
                                                                    byte                                                       */
  __IM  uint32_t  RESERVED9[39];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED10[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED11[110];
  __IOM uint32_t  ERRORSRC;                     /*!< (@ 0x000004C4) Error source                                               */
  __IM  uint32_t  RESERVED12[14];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable TWIM                                                */
  __IM  uint32_t  RESERVED13;
  __IOM TWIM_PSEL_Type PSEL;                    /*!< (@ 0x00000508) Unspecified                                                */
  __IM  uint32_t  RESERVED14[5];
  __IOM uint32_t  FREQUENCY;                    /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK
                                                                    source selected.                                           */
  __IM  uint32_t  RESERVED15[3];
  __IOM TWIM_RXD_Type RXD;                      /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
  __IOM TWIM_TXD_Type TXD;                      /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
  __IM  uint32_t  RESERVED16[13];
  __IOM uint32_t  ADDRESS;                      /*!< (@ 0x00000588) Address used in the TWI transfer                           */
} NRF_TWIM_Type;                                /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                      CTRL_AP_PERI_S                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Control access port (CTRL_AP_PERI_S)
  */

typedef struct {                                /*!< (@ 0x4003D000) CTRL_AP_PERI_S Structure                                   */
  __IM  uint32_t  RESERVED[256];
  __IOM CTRLAPPERI_MAILBOX_Type MAILBOX;        /*!< (@ 0x00000400) Unspecified                                                */
  __IM  uint32_t  RESERVED1[30];
  __IOM CTRLAPPERI_ERASEPROTECT_Type ERASEPROTECT;/*!< (@ 0x00000500) Unspecified                                              */
} NRF_CTRLAPPERI_Type;                          /*!< Size = 1288 (0x508)                                                       */



/* =========================================================================================================================== */
/* ================                                        L2CIPHER_NS                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief L2 Cipher Registers (L2CIPHER_NS)
  */

typedef struct {                                /*!< (@ 0x40040000) L2CIPHER_NS Structure                                      */
  __IM  uint32_t  UNUSED;                       /*!< (@ 0x00000000) Unused.                                                    */
} NRF_L2CIPHER_Type;                            /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         AESL2_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief AES-128 HW accelerator for LTE L2 security and MAC (AESL2_NS)
  */

typedef struct {                                /*!< (@ 0x40042000) AESL2_NS Structure                                         */
  __OM  uint32_t  TASKS_START_GATHER;           /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOP_GATHER;            /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_START_SCATTER;          /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOP_SCATTER;           /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZE_AES;         /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_START_OPERATION;        /*!< (@ 0x00000014) Start cipher / MAC calculation depending on MODE           */
  __OM  uint32_t  TASKS_FINALIZE_MAC;           /*!< (@ 0x00000018) Finalize MAC calculation                                   */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x0000001C) Stop all transfers and crypto operations (initialize)      */
  __IM  uint32_t  RESERVED[56];
  __IOM uint32_t  EVENTS_GATHER_STARTED;        /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHER_DONE;           /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTER_STARTED;       /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTER_DONE;          /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_IV_READY;              /*!< (@ 0x00000110) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_AES_INITIALIZED;       /*!< (@ 0x00000114) New keys and IV taken into use                             */
  __IOM uint32_t  EVENTS_MESSAGE_READY;         /*!< (@ 0x00000118) LENGTH == 0                                                */
  __IOM uint32_t  EVENTS_MAC_READY;             /*!< (@ 0x0000011C) MAC calculated                                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000120) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED1[55];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Keystream length in bits (Cipher), message length
                                                                    in bits (MAC)                                              */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode: 0 == Cipher, 1 == MAC                                */
  __IM  uint32_t  RESERVED4[126];
  __IM  uint32_t  MAC;                          /*!< (@ 0x00000600) EIA2 MAC                                                   */
  __IM  uint32_t  RESERVED5[127];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input job pointer                                          */
  __IM  uint32_t  RESERVED6[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Output job pointer                                         */
} NRF_AESL2_Type;                               /*!< Size = 2308 (0x904)                                                       */



/* =========================================================================================================================== */
/* ================                                          SNOW_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Snow 3G Security IP (SNOW_NS)
  */

